{
  "backend/main.mo": "Motoko canister storing FreeCaseReview entries in a Map with create, get, and list operations.",
  "feature_evidence.json": "Feature evidence list describing required UI changes, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and dark mode styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the LandingPage.",
  "frontend/src/components/landing/ActiveLawsuitsSection.tsx": "Displays active lawsuits in cards with scroll reveal and a CTA scrolling to the contact section.",
  "frontend/src/components/landing/ctaButtonClasses.ts": "Exports shared CSS classes for consistent primary CTA button styling.",
  "frontend/src/components/landing/Footer.tsx": "Footer with brand info, navigation links, social icons, and smooth‑scroll handlers.",
  "frontend/src/components/landing/FreeCaseReviewSection.tsx": "Form component for submitting case reviews with validation, mutation hook, and success view.",
  "frontend/src/components/landing/FreeCaseReviewSuccess.tsx": "Renders a post-submission success screen showing next steps, optional reference ID, and contact options.",
  "frontend/src/components/landing/HeroSection.tsx": "Displays the hero banner with legal consultation messaging, CTAs, stats, and a featured image.",
  "frontend/src/components/landing/HowItWorksSection.tsx": "Shows a three-step explanation of the service process using cards and scroll‑reveal animations.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the full landing page layout, assembling hero, practice areas, lawsuits, how‑it‑works, and contact sections.",
  "frontend/src/components/landing/PracticeAreasSection.tsx": "Lists legal practice areas with icons and descriptions using animated cards.",
  "frontend/src/components/landing/TopNav.tsx": "Provides a sticky navigation bar with scroll‑to‑section links, mobile menu, and a CTA button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on change.",
  "frontend/src/hooks/useCreateFreeCaseReview.ts": "Defines a mutation that maps form data to backend fields, generates a submission ID, and sends a review to the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all reviews or a single review from an actor, handling loading and error cases.",
  "frontend/src/hooks/useScrollReveal.ts": "A hook that reveals an element when it enters the viewport using IntersectionObserver, respecting reduced-motion preferences.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining base styles, USA-themed color variables, dark mode variants, and scroll-reveal animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider and loading global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and responsive container settings using custom CSS variables.",
  "project_state.json": "Stores project state, requirements, styling notes, and known issues for the Sarah Legal one-page marketing site project."
}